import { FormStyled } from './RecipePreparationFields.styled';

export const RecipePreparationFields = () => {
  // форму створив до того як читав ТЗ, треба думати, виправляти
  return <FormStyled>
            <textarea cols={50} rows={10}>

            </textarea>
        </FormStyled>;
};


// "Компонент рендерить textarea елемент.
// Дані введені користувачем в цей елемент повинні записуватись в стейт форми preparation в масив елементів. 
// Кожен з елементів буде містити в собі текст введений користувачем з нового рядка після натискання на клавішу ENTER в текстовому полі.
// Якщо весь текст був написаний без переходу на новий рядок через ENTER, то в масиві  preparation повинен бути один елемент з цим текстом"