import { FormStyled } from './RecipeIngredientsFields.styled';

export const RecipeIngredientsFields = () => {
  return <FormStyled>
    Компонент для додавання інгрідієнтів містить
    <label>
      <input/>
    </label>

    <label>
      <input/>
    </label>
    
    <label>
      <input/>
    </label>
  </FormStyled>;
};

// "Компонент для додавання інгрідієнтів містить:                                                                                                                                        - підзаголовок.                                                                                                                               
//  - лічильник к-сті зазначених інгрідієнтів у рецепті. Кнопки +/- або додають нове поле для воду наприкінці переліку, або видаляють останнє поле. 
//  - поле для внесення даних про інгрідієнти, складається з: 
//      * назва інгрідієнта(обирається з випадаючого списку, який приходить з бекенду) 
//      * к-сть інгрідієнта + міра к-сті (обирається з випадаючого списку)
//      * кнопка видалення, по кліку на яку воно видаляється зі стейту і сторінки."